Reports/ДвиженияОстаткиБСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Report>
		<Properties>
			<Name>ДвиженияОстаткиБСО</Name>
			<Comment>(локализация)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БланкиСтрогойОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/БланкиСтрогойОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>БланкиСтрогойОтчетности</Name>
			<Comment>(локализация)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БланкиСтрогойОтчетности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/СписаниеИзЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>СписаниеИзЭксплуатации</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ФактическиеДанныеБюджетирования</xr:Item>
				<xr:Item>AccumulationRegister.ТМЦВЭксплуатации</xr:Item>
				<xr:Item>AccumulationRegister.БланкиСтрогойОтчетности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимИспользованияБСО</Name>
					<Comment>(локализация)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСписанныхБСО</Name>
					<Comment>(локализация)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСписанияБСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПартияТМЦВЭксплуатации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииТМЦВЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипБСО</Name>
							<Comment>(локализация)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.БланкиСтрогойОтчетности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияБСО</Name>
							<Comment>(локализация)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныйНомерБСО</Name>
							<Comment>(локализация)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечныйНомерБСО</Name>
							<Comment>(локализация)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ДвиженияОстаткиБСО/Ext/ObjectModule.bsl
Перем мСписокОтбора;
Перем ПостроительОстаткиБСО;
Перем ПостроительГлавный;

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗаполнитьНастройки();
	ДокументРезультат.Вывести(СформироватьОтчет());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНастройки()
	ПостроительОстаткиБСО.Текст =
	"ВЫБРАТЬ
	|	БланкиСтрогойОтчетности.Склад КАК Склад,
	|	БланкиСтрогойОтчетности.ФизическоеЛицо КАК ФизическоеЛицо,
	|	БланкиСтрогойОтчетности.Номенклатура КАК Номенклатура,
	|	БланкиСтрогойОтчетности.Тип КАК Тип,
	|	БланкиСтрогойОтчетности.Серия КАК Серия,
	|	БланкиСтрогойОтчетности.Номер КАК Номер,
	|	БланкиСтрогойОтчетности.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.БланкиСтрогойОтчетности.Остатки(&Дата, {(Склад).* КАК Склад, (ФизическоеЛицо).* КАК ФизическоеЛицо, (Номенклатура).* КАК Номенклатура, (Тип).* КАК Тип, (Серия) КАК Серия}) КАК БланкиСтрогойОтчетности
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склад,
	|	ФизическоеЛицо,
	|	Номенклатура,
	|	Тип,
	|	Серия,
	|	Номер
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Для Каждого ЭлементСписка Из мСписокОтбора Цикл
		Если ПостроительОстаткиБСО.Отбор.Найти(ЭлементСписка.Значение) = Неопределено Тогда
			ПостроительОстаткиБСО.Отбор.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ПостроительГлавный.Текст =
	"ВЫБРАТЬ
	|	БланкиСтрогойОтчетности.Период КАК Дата,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(БланкиСтрогойОтчетности.Регистратор) = ТИП(Документ.СписаниеИзЭксплуатации)
	|				ИЛИ ТИПЗНАЧЕНИЯ(БланкиСтрогойОтчетности.Регистратор) = ТИП(Документ.ВнутреннееПотреблениеТоваров)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоСписание,
	|	ВЫБОР
	|		КОГДА БланкиСтрогойОтчетности.КоличествоПриход > 0
	|			ТОГДА ""Приход""
	|		ИНАЧЕ ""Расход""
	|	КОНЕЦ КАК ТипДвижения,
	|	БланкиСтрогойОтчетности.Склад КАК Склад,
	|	БланкиСтрогойОтчетности.ФизическоеЛицо КАК ФизическоеЛицо,
	|	БланкиСтрогойОтчетности.Номенклатура КАК Номенклатура,
	|	БланкиСтрогойОтчетности.Тип КАК Тип,
	|	БланкиСтрогойОтчетности.Серия КАК Серия,
	|	БланкиСтрогойОтчетности.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА БланкиСтрогойОтчетности.КоличествоПриход <> 0
	|			ТОГДА БланкиСтрогойОтчетности.КоличествоПриход
	|		ИНАЧЕ БланкиСтрогойОтчетности.КоличествоРасход
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	РегистрНакопления.БланкиСтрогойОтчетности.ОстаткиИОбороты(&ДатаНач, &ДатаКон, Регистратор, , {(Склад).* КАК Склад, (ФизическоеЛицо).* КАК ФизическоеЛицо, (Номенклатура).* КАК Номенклатура, (Тип).* КАК Тип, (Серия) КАК Серия}) КАК БланкиСтрогойОтчетности
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склад,
	|	ФизическоеЛицо,
	|	Номенклатура,
	|	Тип,
	|	Серия,
	|	Номер
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Для Каждого ЭлементСписка Из мСписокОтбора Цикл
		Если ПостроительГлавный.Отбор.Найти(ЭлементСписка.Значение) = Неопределено Тогда
			ПостроительГлавный.Отбор.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Склад) Тогда
		ПостроительГлавный.Отбор.Склад.Значение = Склад;
		ПостроительГлавный.Отбор.Склад.Использование = Истина;
		ПостроительОстаткиБСО.Отбор.Склад.Значение = Склад;
		ПостроительОстаткиБСО.Отбор.Склад.Использование = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		ПостроительГлавный.Отбор.Номенклатура.Значение = Номенклатура;
		ПостроительГлавный.Отбор.Номенклатура.Использование = Истина;
		ПостроительОстаткиБСО.Отбор.Номенклатура.Значение = Номенклатура;
		ПостроительОстаткиБСО.Отбор.Номенклатура.Использование = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		ПостроительГлавный.Отбор.ФизическоеЛицо.Значение = ФизическоеЛицо;
		ПостроительГлавный.Отбор.ФизическоеЛицо.Использование = Истина;
		ПостроительОстаткиБСО.Отбор.ФизическоеЛицо.Значение = ФизическоеЛицо;
		ПостроительОстаткиБСО.Отбор.ФизическоеЛицо.Использование = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Серия) Тогда
		ПостроительГлавный.Отбор.Серия.Значение = Серия;
		ПостроительГлавный.Отбор.Серия.Использование = Истина;
		ПостроительОстаткиБСО.Отбор.Серия.Значение = Серия;
		ПостроительОстаткиБСО.Отбор.Серия.Использование = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Тип) Тогда
		ПостроительГлавный.Отбор.Тип.Значение = Тип;
		ПостроительГлавный.Отбор.Тип.Использование = Истина;
		ПостроительОстаткиБСО.Отбор.Тип.Значение = Тип;
		ПостроительОстаткиБСО.Отбор.Тип.Использование = Истина;
	КонецЕсли;
КонецПроцедуры

Функция СформироватьОтчет()
	ПоказыватьЗаголовок = Истина;
	ДопПробелы = Символ(32) + Символ(32) + Символ(32);
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Отчет_ДвиженияОстаткиБСО";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСлева = 10;
	ТабДок.ПолеСнизу = 5;
	ТабДок.ПолеСправа = 5;
	
	Макет = ПолучитьМакет("Макет");
	
	НачДата = НачалоДня(ДатаНачала);
	КонДата = ?(ЗначениеЗаполнено(ДатаОкончания), КонецДня(ДатаОкончания), ТекущаяДата());
	
	ТаблицаОстатков = УчетБланковСтрогойОтчетностиСервер.СтруктураСлужебнойТаблицыБСО();
	
	ПостроительОстаткиБСО.Параметры.Вставить("Дата", Новый Граница(НачДата, ВидГраницы.Включая));
	ПостроительОстаткиБСО.Выполнить();
	НачальныйОстаток = ПостроительОстаткиБСО.Результат.Выгрузить();
	НачальныйОстаток = СвернутьТаблицуПоИнтервалу(НачальныйОстаток);
	НачальныйОстаток.ЗаполнитьЗначения(Формат(НачДата, "ДФ=dd.MM.yy"), "Дата");
	
	ПостроительОстаткиБСО.Параметры.Вставить("Дата", Новый Граница(КонДата, ВидГраницы.Включая));
	ПостроительОстаткиБСО.Выполнить();
	КонечныйОстаток = ПостроительОстаткиБСО.Результат.Выгрузить();
	КонечныйОстаток = СвернутьТаблицуПоИнтервалу(КонечныйОстаток);
	КонечныйОстаток.ЗаполнитьЗначения(Формат(КонДата, "ДФ=dd.MM.yy"), "Дата");
	
	// приход и расход
	ПостроительГлавный.Параметры.Вставить("ДатаНач", НачДата);
	ПостроительГлавный.Параметры.Вставить("ДатаКон", КонДата);
	ПостроительГлавный.Выполнить();
	ТЗПриходРасход = ПостроительГлавный.Результат.Выгрузить();
	
	Отбор = Новый Структура;
	Отбор.Вставить("ТипДвижения", "Приход");
	Приход = ТЗПриходРасход.Скопировать(Отбор);
	Приход = СвернутьТаблицуПоИнтервалу(Приход);
	
	Отбор = Новый Структура;
	Отбор.Вставить("ТипДвижения", "Расход");
	Отбор.Вставить("ЭтоСписание", Истина);
	Списание = ТЗПриходРасход.Скопировать(Отбор);
	Списание = СвернутьТаблицуПоИнтервалу(Списание);
	
	Отбор = Новый Структура;
	Отбор.Вставить("ТипДвижения", "Расход");
	Отбор.Вставить("ЭтоСписание", Ложь);
	Расход = ТЗПриходРасход.Скопировать(Отбор);
	Расход = СвернутьТаблицуПоИнтервалу(Расход);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрокаОстаток = Макет.ПолучитьОбласть("СтрокаОстаток");
	ОбластьСтрокаЗаголовок = Макет.ПолучитьОбласть("СтрокаЗаголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Если ПоказыватьЗаголовок Тогда
		ЗаголовокОтчета = Макет.ПолучитьОбласть("Заголовок");
		ЗаголовокОтчета.Параметры.ОписаниеПериода = УчетБланковСтрогойОтчетностиСервер.СформироватьСтрокуВыводаПараметровПоДатам(НачДата, КонДата);
		ТабДок.Вывести(ЗаголовокОтчета);
		
		СтрОтбор = УчетБланковСтрогойОтчетностиСервер.СформироватьСтрокуОтборов(ПостроительГлавный.Отбор);
		Если Не ПустаяСтрока(СтрОтбор) Тогда
			ОбластьОтбор = Макет.ПолучитьОбласть("СтрокаОтбор");
			ОбластьОтбор.Параметры.ТекстПроОтбор = "Отбор: " + СтрОтбор;
			ТабДок.Вывести(ОбластьОтбор);
		КонецЕсли;
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьСтрокаЗаголовок.Параметры.ТекстОснование = "Остаток неиспользованных бланков на " + Формат(НачДата, "ДФ=dd.MM.yyyy");
	ОбластьСтрокаЗаголовок.Параметры.Количество = НачальныйОстаток.Итог("Количество");
	ТабДок.Вывести(ОбластьСтрокаЗаголовок);
	
	Для Каждого СтрокаНачОст Из НачальныйОстаток Цикл
		ОбластьСтрокаОстаток.Параметры.Заполнить(СтрокаНачОст);
		ТабДок.Вывести(ОбластьСтрокаОстаток);
	КонецЦикла;
	
	ОбластьСтрокаЗаголовок.Параметры.ТекстОснование = "Получено за период";
	ОбластьСтрокаЗаголовок.Параметры.Количество = Приход.Итог("Количество");
	ТабДок.Вывести(ОбластьСтрокаЗаголовок);
	
	Для Каждого СтрокаНачОст Из Приход Цикл
		ОбластьСтрокаОстаток.Параметры.Заполнить(СтрокаНачОст);
		ТабДок.Вывести(ОбластьСтрокаОстаток);
	КонецЦикла;
	
	ОбластьСтрокаЗаголовок.Параметры.ТекстОснование = "Израсходовано за период";
	ОбластьСтрокаЗаголовок.Параметры.Количество = Списание.Итог("Количество") + Расход.Итог("Количество");
	ТабДок.Вывести(ОбластьСтрокаЗаголовок);
	
	ОбластьСтрокаЗаголовок.Параметры.ТекстОснование = ДопПробелы + "Израсходовано (списано)";
	ОбластьСтрокаЗаголовок.Параметры.Количество = Списание.Итог("Количество");
	ТабДок.Вывести(ОбластьСтрокаЗаголовок);
	
	Для Каждого СтрокаНачОст Из Списание Цикл
		ОбластьСтрокаОстаток.Параметры.Заполнить(СтрокаНачОст);
		ТабДок.Вывести(ОбластьСтрокаОстаток);
	КонецЦикла;
	
	ОбластьСтрокаЗаголовок.Параметры.ТекстОснование = ДопПробелы + "Передано (внутреннее перемещение)";
	ОбластьСтрокаЗаголовок.Параметры.Количество = Расход.Итог("Количество");
	ТабДок.Вывести(ОбластьСтрокаЗаголовок);
	
	Для Каждого СтрокаНачОст Из Расход Цикл
		ОбластьСтрокаОстаток.Параметры.Заполнить(СтрокаНачОст);
		ТабДок.Вывести(ОбластьСтрокаОстаток);
	КонецЦикла;
	
	ОбластьСтрокаЗаголовок.Параметры.ТекстОснование = "Остаток неиспользованных бланков на " + Формат(КонДата, "ДФ=dd.MM.yyyy");
	ОбластьСтрокаЗаголовок.Параметры.Количество = КонечныйОстаток.Итог("Количество");
	ТабДок.Вывести(ОбластьСтрокаЗаголовок);
	
	Для Каждого СтрокаНачОст Из КонечныйОстаток Цикл
		ОбластьСтрокаОстаток.Параметры.Заполнить(СтрокаНачОст);
		ТабДок.Вывести(ОбластьСтрокаОстаток);
	КонецЦикла;
	
	ОбластьПодвал.Параметры.Исполнитель = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(Пользователи.ТекущийПользователь().ФизическоеЛицо);
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
КонецФункции

Функция СвернутьТаблицуПоИнтервалу(ИсходнаяТаблица)
	ТЗ = УчетБланковСтрогойОтчетностиСервер.СтруктураСлужебнойТаблицыБСО();
	Для каждого Стр Из ИсходнаяТаблица Цикл
		НоваяСтрока = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		НоваяСтрока.Серия = СокрЛП(Стр.Серия);
	КонецЦикла;
	
	Если ТЗ.Количество() > 0 Тогда
		ТЗ = УчетБланковСтрогойОтчетностиСервер.СвернутьТаблицуБСО(ТЗ, Ложь);
	КонецЕсли;
	
	ТЗ.Колонки.Добавить("Дата");
	
	Возврат ТЗ;
КонецФункции

#КонецОбласти

#КонецЕсли

мСписокОтбора = Новый СписокЗначений;
мСписокОтбора.Добавить("Склад");
мСписокОтбора.Добавить("ФизическоеЛицо");
мСписокОтбора.Добавить("Номенклатура");
мСписокОтбора.Добавить("Тип");
мСписокОтбора.Добавить("Серия");

ПостроительОстаткиБСО = Новый ПостроительОтчета;
ПостроительГлавный = Новый ПостроительОтчета;
